Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ128MC708.h
/* C1FMSKSEL1 */
/* Bitname _F0MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F1MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F2MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F3MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F4MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F5MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F6MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F7MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F0MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F0MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F1MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F1MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F2MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F2MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F3MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F3MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F4MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F4MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F5MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F5MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F6MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F6MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F7MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F7MSK1 cannot be defined because it is used by more than one SFR */

/* C1FMSKSEL2 */
/* Bitname _F8MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F9MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F10MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F11MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F12MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F13MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F14MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F15MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F8MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F8MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F9MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F9MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F10MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F10MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F11MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F11MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F12MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F12MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F13MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F13MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F14MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F14MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F15MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F15MSK1 cannot be defined because it is used by more than one SFR */

/* C1BUFPNT1 */
/* Bitname _F0BP cannot be defined because it is used by more than one SFR */
/* Bitname _F1BP cannot be defined because it is used by more than one SFR */
/* Bitname _F2BP cannot be defined because it is used by more than one SFR */
/* Bitname _F3BP cannot be defined because it is used by more than one SFR */
/* Bitname _F0BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F0BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F0BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F0BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F1BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F1BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F1BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F1BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F2BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F2BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F2BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F2BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F3BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F3BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F3BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F3BP3 cannot be defined because it is used by more than one SFR */

/* C1RXFUL1 */
/* Bitname _RXFUL0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL6 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL7 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL8 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL9 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL10 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL11 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL12 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL13 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL14 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL15 cannot be defined because it is used by more than one SFR */

/* C1BUFPNT2 */
/* Bitname _F4BP cannot be defined because it is used by more than one SFR */
/* Bitname _F5BP cannot be defined because it is used by more than one SFR */
/* Bitname _F6BP cannot be defined because it is used by more than one SFR */
/* Bitname _F7BP cannot be defined because it is used by more than one SFR */
/* Bitname _F4BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F4BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F4BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F4BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F5BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F5BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F5BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F5BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F6BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F6BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F6BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F6BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F7BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F7BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F7BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F7BP3 cannot be defined because it is used by more than one SFR */

/* C1RXFUL2 */
/* Bitname _RXFUL16 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL17 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL18 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL19 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL20 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL21 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL22 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL23 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL24 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL25 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL26 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL27 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL28 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL29 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL30 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL31 cannot be defined because it is used by more than one SFR */

/* C1BUFPNT3 */
/* Bitname _F8BP cannot be defined because it is used by more than one SFR */
/* Bitname _F9BP cannot be defined because it is used by more than one SFR */
/* Bitname _F10BP cannot be defined because it is used by more than one SFR */
/* Bitname _F11BP cannot be defined because it is used by more than one SFR */

/* C1BUFPNT4 */
/* Bitname _F12BP cannot be defined because it is used by more than one SFR */
/* Bitname _F13BP cannot be defined because it is used by more than one SFR */
/* Bitname _F14BP cannot be defined because it is used by more than one SFR */
/* Bitname _F15BP cannot be defined because it is used by more than one SFR */

/* C1RXOVF1 */
/* Bitname _RXOVF0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF6 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF7 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF8 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF9 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF10 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF11 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF12 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF13 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF14 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF15 cannot be defined because it is used by more than one SFR */

/* C1RXOVF2 */
/* Bitname _RXOVF16 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF17 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF18 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF19 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF20 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF21 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF22 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF23 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF24 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF25 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF26 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF27 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF28 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF29 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF30 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF31 cannot be defined because it is used by more than one SFR */

/* C1RXM0SID */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C1TR01CON */
/* Bitname _TX0PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX1PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX0PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX0PRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX1PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX1PRI1 cannot be defined because it is used by more than one SFR */

/* C1RXM0EID */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */

/* C1TR23CON */
/* Bitname _TX2PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TX3PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TX2PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX2PRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX3PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX3PRI1 cannot be defined because it is used by more than one SFR */

/* C1RXM1SID */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C1TR45CON */
/* Bitname _TX4PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TX5PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _TX4PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX4PRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX5PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX5PRI1 cannot be defined because it is used by more than one SFR */

/* C1RXM1EID */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */

